content/posts/Gauge_Theories_in_Particle_Physics_A_Practical_Introduction,_Volume_1_From_Relativistic_Quantum_Mechanics_to_QED_by_Aitchison_and_Hey_in_2013.md
+++
title = "Gauge Theories in Particle Physics A Practical Introduction, Volume 1 From Relativistic Quantum Mechanics to QED by Aitchison and Hey in 2013"
author = ["Cameron Smith"]
lastmod = 2020-09-20T17:34:31-04:00
slug = "Gauge_Theories_in_Particle_Physics_A_Practical_Introduction,_Volume_1_From_Relativistic_Quantum_Mechanics_to_QED_by_Aitchison_and_Hey_in_2013"
draft = false
+++

## I. Introductory survey, Electromagnetism as a Gauge Theory, and Relativistic Quantum Mechanics {#i-dot-introductory-survey-electromagnetism-as-a-gauge-theory-and-relativistic-quantum-mechanics}


### 1. The particles and forces of the Standard Model {#1-dot-the-particles-and-forces-of-the-standard-model}

<!--list-separator-->

-  1.1 Introduction: the Standard Model

<!--list-separator-->

-  1.2 The fermions of the Standard Model

    <!--list-separator-->

    -  1.2.1 Leptons

    <!--list-separator-->

    -  1.2.2 Quarks

<!--list-separator-->

-  1.3 Particle interactions in the Standard Model

    <!--list-separator-->

    -  1.3.1 Classical and quantum fields

    <!--list-separator-->

    -  1.3.2 The Yukawa theory of force as virtual quantum exchange

    <!--list-separator-->

    -  1.3.3 The one-quantum exchange amplitude

    <!--list-separator-->

    -  1.3.4 Electromagnetic interactions

    <!--list-separator-->

    -  1.3.5 Weak interactions

    <!--list-separator-->

    -  1.3.6 Strong interactions

    <!--list-separator-->

    -  1.3.7 The gauge bosons of the Standard Model

<!--list-separator-->

-  1.4 Renormalization and the Higgs sector of the Standard Model

    <!--list-separator-->

    -  1.4.1 Renormalization

    <!--list-separator-->

    -  1.4.2 The Higgs boson of the Standard Model

<!--list-separator-->

-  1.5 Summary

<!--list-separator-->

-  Problems


### 2. Electromagnetism as a Gauge Theory {#2-dot-electromagnetism-as-a-gauge-theory}

<!--list-separator-->

-  2.1 Introduction

<!--list-separator-->

-  2.2 The Maxwell equations: current conservation

<!--list-separator-->

-  2.3 The Maxwell equations: Lorentz covariance and gauge invariance

<!--list-separator-->

-  2.4 Gauge invariance (and covariance) in quantum mechanics

<!--list-separator-->

-  2.5 The argument reversed: the gauge principle

<!--list-separator-->

-  2.6 Comments on the gauge principle in electromagnetism

<!--list-separator-->

-  Problems


### 3. Relativistic quantum mechanics {#3-dot-relativistic-quantum-mechanics}

<!--list-separator-->

-  3.1 The Klein-Gordon equation

    <!--list-separator-->

    -  3.1.1 Solution in coordinate space

    <!--list-separator-->

    -  3.1.2 Probability current for the KG equation

<!--list-separator-->

-  3.2 The Dirac equation

    <!--list-separator-->

    -  3.2.1 Free-particle solutions

    <!--list-separator-->

    -  3.2.2 Probability current for the Dirac equation

<!--list-separator-->

-  3.3 Spin

<!--list-separator-->

-  3.4 The negative-energy solutions

    <!--list-separator-->

    -  3.4.1 Positive-energy spinors

    <!--list-separator-->

    -  3.4.2 Negative-energy spinors

    <!--list-separator-->

    -  3.4.3 Dirac's interpretation of the negative-energy solutions of the Dirac equation

    <!--list-separator-->

    -  3.4.4 Feynman's interpretation of the negative-energy solutions of the KG and Dirac equations

<!--list-separator-->

-  3.5 Inclusion of electromagnetic interactions via the gauge principle: the Dirac prediction of \\[g=2\\] for the electron

<!--list-separator-->

-  Problems


### 4. Lorentz transformations and discrete symmetries {#4-dot-lorentz-transformations-and-discrete-symmetries}

<!--list-separator-->

-  4.1 Lorentz transformations

    <!--list-separator-->

    -  4.1.1 The KG equation

    <!--list-separator-->

    -  4.1.2 The Dirac equation

<!--list-separator-->

-  4.2 Discrete transformations: P, C, and T

    <!--list-separator-->

    -  4.2.1 Parity

    <!--list-separator-->

    -  4.2.2 Charge conjugation

    <!--list-separator-->

    -  4.2.3 CP

    <!--list-separator-->

    -  4.2.4 Time reversal

    <!--list-separator-->

    -  4.2.5 CPT

    <!--list-separator-->

    -  Problems


## II. Introduction to Quantum Field Theory {#ii-dot-introduction-to-quantum-field-theory}


### 5. Quantum Field Theory I: The Free Scalar Field {#5-dot-quantum-field-theory-i-the-free-scalar-field}

<!--list-separator-->

-  5.1 The quantum field: (i) descriptive

<!--list-separator-->

-  5.2 The quantum field: (ii) Lagrange-Hamilton formulation

<!--list-separator-->

-  5.3 Generalizations: four dimensions, relativity, and mass

<!--list-separator-->

-  Problems


### 6. Quantum Field Theory II: Interacting Scalar Fields {#6-dot-quantum-field-theory-ii-interacting-scalar-fields}

<!--list-separator-->

-  6.1 Interactions in quantum field theory: qualitative introduction

<!--list-separator-->

-  6.2 Perturbation theory for interacting fields: the Dyson expansion of the S-matrix

    <!--list-separator-->

    -  6.2.1 The interaction picture

    <!--list-separator-->

    -  6.2.2 The S-matrix and the Dyson expansion

<!--list-separator-->

-  6.3 Applications to the ABC theory

    <!--list-separator-->

    -  6.3.1 The decay \\[C \rightarrow A + B\\]

    <!--list-separator-->

    -  6.3.2 \\[A + B \rightarrow A + B\\] scattering: the amplitudes

    <!--list-separator-->

    -  6.3.3 \\[A + B \rightarrow A + B\\] scattering: the Yukawa exchange mechanism \\[s\\] and \\[u\\] channel processes

    <!--list-separator-->

    -  6.3.4 \\[A + B \rightarrow A + B\\] scattering: the differential cross section

    <!--list-separator-->

    -  6.3.5 \\[A + B \rightarrow A + B\\] scattering: loose ends

    <!--list-separator-->

    -  Problems


### 7. Quantum Field Theory III: Complex scalar fields, Dirac and Maxwell Fields; Introduction of Electromagnetic Interactions {#7-dot-quantum-field-theory-iii-complex-scalar-fields-dirac-and-maxwell-fields-introduction-of-electromagnetic-interactions}

<!--list-separator-->

-  7.1 The complex scalar field: global \\[U(1)\\] phase invariance, particles and antiparticles

<!--list-separator-->

-  7.2 The Dirac field and the spin-statistics connection

<!--list-separator-->

-  7.3 The Maxwell field \\[A^{\mu}(x)\\]

    <!--list-separator-->

    -  7.3.1 The classical field case

    <!--list-separator-->

    -  7.3.2 Quantizing $$A<sup>&mu;</sup>(x)

<!--list-separator-->

-  7.4 Introduction of electromagnetic interactions

<!--list-separator-->

-  7.5 \\[\mathbf{P}\\], \\[\mathbf{C}\\], and \\[\mathbf{T}\\] in quantum field theory

    <!--list-separator-->

    -  7.5.1 Parity

    <!--list-separator-->

    -  7.5.2 Charge conjugation

    <!--list-separator-->

    -  7.5.3 Time reversal

<!--list-separator-->

-  Problems


## III. Tree-level applications in QED {#iii-dot-tree-level-applications-in-qed}


### 8. Elementary processes in scalar and spinor electrodynamics {#8-dot-elementary-processes-in-scalar-and-spinor-electrodynamics}

<!--list-separator-->

-  8.1 Coulomb scattering of charged spin-0 particles

<!--list-separator-->

-  8.2 Coulomb scattering of charged spin-1/2 particles

<!--list-separator-->

-  8.3 \\[e^-s^+\\] scattering

    <!--list-separator-->

    -  8.3.1 The amplitude for \\[e^-s^+ \rightarrow e^-s^+\\]

    <!--list-separator-->

    -  8.3.2 The cross section for \\[e^-s^+ \rightarrow e^-s^+\\]

<!--list-separator-->

-  8.4 Scattering from a non-point-like object: the pion form factor in \\[e^-\pi^+ \rightarrow e^-\pi^+\\]

    <!--list-separator-->

    -  8.4.1 \\[e^-\\] scattering from a charge distribution

    <!--list-separator-->

    -  8.4.2 Lorentz invariance

    <!--list-separator-->

    -  8.4.3 Current conservation

<!--list-separator-->

-  8.5 The form factor in the time-like region: \\[e^+e^\* \rightarrow \pi^+\pi^-\\] and crossing symmetry

<!--list-separator-->

-  8.6 Electron compton scattering

    <!--list-separator-->

    -  8.6.1 The lowest-order amplitudes

    <!--list-separator-->

    -  8.6.2 Gauge invariance

    <!--list-separator-->

    -  8.6.3 The Compton cross section

<!--list-separator-->

-  8.7 Electron muon elastic scattering

<!--list-separator-->

-  8.8 Electron-proton elastic scattering and nucleon form factors

    <!--list-separator-->

    -  8.8.1 Lorentz invariance

    <!--list-separator-->

    -  8.8.2 Current conservation

<!--list-separator-->

-  Problems


### 9. Deep inelastic electron-nucleon scattering and the parton model {#9-dot-deep-inelastic-electron-nucleon-scattering-and-the-parton-model}

<!--list-separator-->

-  9.1 Inelastic electron-proton scattering: kinematics and structure functions

<!--list-separator-->

-  9.2 Bjorken scaling and the parton model

<!--list-separator-->

-  9.3 Partons as quarks and gluons

<!--list-separator-->

-  9.4 The Drell-Yan process

<!--list-separator-->

-  9.5 \\[e^+e^-\\] annihilation into hadrons

<!--list-separator-->

-  Problems


## IV. Loops and Renormalization {#iv-dot-loops-and-renormalization}


### 10. Loops and renormalization I: The ABC theory {#10-dot-loops-and-renormalization-i-the-abc-theory}

<!--list-separator-->

-  10.1 The propagator correction in ABC theory

    <!--list-separator-->

    -  10.1.1 The \\[O(g^2)\\] self-energy \\[\Pi\_C^{[2]}(q^2)\\]

    <!--list-separator-->

    -  10.1.2 Mass shift

    <!--list-separator-->

    -  10.1.3 Field strength renormalization

<!--list-separator-->

-  10.2 The vertex correction

<!--list-separator-->

-  10.3 Dealing with the bad news: a simple example

    <!--list-separator-->

    -  10.3.1 Evaluating \\[\Pi\_C^{[2]}(q^2)\\]

    <!--list-separator-->

    -  10.3.2 Regularization and renormalization

<!--list-separator-->

-  10.4 Bare and renormalized perturbation theory

    <!--list-separator-->

    -  10.4.1 Reorganizing perturbation theory

    <!--list-separator-->

    -  10.4.2 The \\[O(g^2\_{ph})\\] renormalized self-energy revisited: how counter terms are determined by renormalization conditions

<!--list-separator-->

-  10.5 Renormalizability

<!--list-separator-->

-  Problems


### 11. Loops and renormalization II: QED {#11-dot-loops-and-renormalization-ii-qed}

<!--list-separator-->

-  11.1 Counter terms

<!--list-separator-->

-  11.2 The \\[O(e^2)\\] fermion self-energy

<!--list-separator-->

-  11.3 The \\[O(e^2)\\] photon self-energy

<!--list-separator-->

-  11.4 The \\[O(e^2)\\] renormalized photon self-energy

<!--list-separator-->

-  11.5 The physics of \\[\bar{\Pi}\_{\gamma}^{[2]}(q^2)\\]

    <!--list-separator-->

    -  11.5.1 Modified Coulomb's law

    <!--list-separator-->

    -  11.5.2 Radiatively induced charge form factor

    <!--list-separator-->

    -  11.5.3 The running coupling constant

    <!--list-separator-->

    -  11.5.4 \\[\bar{\Pi}\_{\gamma}^{[2]}\\] in the \\[s\\]-channel

<!--list-separator-->

-  11.6 The \\[O(e^2)\\] vertex correction, and \\[Z\_1 = Z\_2\\]

<!--list-separator-->

-  11.7 The anomalous magnetic moment and tests of QED

<!--list-separator-->

-  11.8 Which theories are renormalizable -\* and does it matter?

<!--list-separator-->

-  Problems


## Appendices {#appendices}


### A. Non-relativistic quantum mechanics {#a-dot-non-relativistic-quantum-mechanics}


### B. Natural units {#b-dot-natural-units}


### C. Maxwell's equations: choice of units {#c-dot-maxwell-s-equations-choice-of-units}


### D. Special relativity: invariance and covariance {#d-dot-special-relativity-invariance-and-covariance}


### E. Dirac \\[\delta\\]-function {#e-dot-dirac-delta-function}


### F. Contour integration {#f-dot-contour-integration}


### G. Green functions {#g-dot-green-functions}


### H. Elements of non-relativistic scattering theory {#h-dot-elements-of-non-relativistic-scattering-theory}

<!--list-separator-->

-  H.1 Time-independent formulation and differential cross section

<!--list-separator-->

-  H.2 Expression for the scattering amplitude: Born approximation

<!--list-separator-->

-  H.3 Time-dependent approach


### I. The Schrodinger and Heisenberg pictures {#i-dot-the-schrodinger-and-heisenberg-pictures}


### J. Dirac algebra and trace identities {#j-dot-dirac-algebra-and-trace-identities}

<!--list-separator-->

-  J.1 Dirac algebra

<!--list-separator-->

-  J.2 Trace theorems


### K. Example of a cross section calculation {#k-dot-example-of-a-cross-section-calculation}

<!--list-separator-->

-  K.1 The spin-averaged squared matrix element

<!--list-separator-->

-  K.2 Evaluation of two-body Lorentz-invariant phase space in 'laboratory' variables


### L. Feynman rules for tree graphs in QED {#l-dot-feynman-rules-for-tree-graphs-in-qed}

<!--list-separator-->

-  L.1 External particles

<!--list-separator-->

-  L.2 Propagators

<!--list-separator-->

-  L.3 Vertices
